IdeaRS.OpenModel.Detail.DappedEnd
Representation of dapped end in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.DappedEnd.#ctor
Constructor

IdeaRS.OpenModel.Detail.DappedEnd.GeomId
Id representing geometrical parts of Detail

IdeaRS.OpenModel.Detail.DappedEnd.Width
Width of dapped end

IdeaRS.OpenModel.Detail.DappedEnd.Height
Height of dapped end

IdeaRS.OpenModel.Detail.DappedEnd.MasterComponent
Master component

IdeaRS.OpenModel.Detail.DappedEnd.MasterPoint
Insert point 0 - 1

IdeaRS.OpenModel.Detail.DappedEnd.Outline
Outline of dapped end

IdeaRS.OpenModel.Detail.DappedEnd.Position
Offset between MasterPoint and InsertPoint

IdeaRS.OpenModel.Detail.DappedEnd.DappedEndHaunch
Type of haunch on dapped end

IdeaRS.OpenModel.Detail.DappedEnd.Haunch
Haunch size of dapped end

IdeaRS.OpenModel.Detail.DappedEnd.Rotation
Rotation of dapped end